Интенсивное_обучение_программированию/src/DataProcessors/ЗаполнениеПроизводственногоКалендаря/ЗаполнениеПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеПроизводственногоКалендаря</name>
  <comment>Заполнение производственного календаря</comment>
  <attributes>
    <name>НормаЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДней</name>
    <comment>Список дней</comment>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Рабочий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Интенсивное_обучение_программированию/src/InformationRegisters/ПроизводственныйКалендарь/ПроизводственныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроизводственныйКалендарь</name>
  <comment>Производственный календарь</comment>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Интенсивное_обучение_программированию/src/DataProcessors/ЗаполнениеПроизводственногоКалендаря/Forms/ФормаОбработки/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьСписокДней(Команда)
	
	Если Объект.ДатаНачала = '0001-01-01' ИЛИ Объект.ДатаОкончания = '0001-01-01' Тогда
		
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = "Интервал загрузки не указан!";
		Сообщение.Сообщить();
		ТекущийЭлемент = Элементы.ДатаНачала;
		Возврат;
		
	КонецЕсли;
	
	Объект.СписокДней.Очистить();
	ТекущийДень = Объект.ДатаНачала;
	
	Пока ТекущийДень <= Объект.ДатаОкончания Цикл
		
		НоваяСтрока = Объект.СписокДней.Добавить();
		НоваяСтрока.Дата = ТекущийДень;
		НоваяСтрока.Рабочий = (ДеньНедели(НоваяСтрока.Дата) < 6);
		НоваяСтрока.КоличествоЧасов = Объект.НормаЧасов;
		ТекущийДень = ТекущийДень + 86400;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеКалендаря(Команда)

	Если Объект.СписокДней.Количество() = 0 Тогда
		
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = "Нет данных для импорта!";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	ЗагрузитьДанныеКалендаряНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьДанныеКалендаряНаСервере()
	
	Отбор = Новый Структура ("Рабочий", Истина);
	ТаблицаГрафика = Объект.СписокДней.НайтиСтроки(Отбор);
	
	РегистрыСведений.ПроизводственныйКалендарь.ЗаполнитьГрафикПоТаблице (ТаблицаГрафика);
	
КонецПроцедуры

#КонецОбласти
